<?php

use App\Article;
use Illuminate\Database\Seeder;

class ArticlesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $category = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
        $title = [
            'فوائد الكزبرة للشعر: حل سحري لتساقط الشعر؟',
            'أفضل أنواع السلطات التي تساعد على الشبع',
            'تطوير آلية لحماية الأطفال من الإصابة بالسكري مبكرًا',
            'تشخيص السرطان',
            'دراسة: بعد السبعين من العمر يصبح الإنسان أسعد',
            'دهون البطن قد تسبب إصابتك بالنوبة القلبية أكثر من مرة',
            'مضار الخلطات العشبية',
            'أمور عليك معرفتها حول التلقيح الصناعي',
            'فيتامينات ومعادن تعزز الصحة الجنسية',
            'الموعد المناسب لذهاب الطفل للحضانة
'
        ];
        $decription = [
            'تعتبر الكزبرة إحدى النباتات التي تتمتع بفوائد صحية قد تكون خارقة! ولكن ربما لم تكن تعرف من قبل عن فوائد الكزبرة للشعر تحديداً، وهذا ما سوف نتناوله في ما يلي.

            فوائد الكزبرة للشعر
            عندما يتعلق الأمر بصحة الشعر، فالكزبرة تحتل مكانة خاصة! هذه هي أهم فوائد الكزبرة للشعر:

            مكافحة تساقط الشعر: تساعد الكزبرة بما فيها من مواد غذائية هامة على منع تساقط الشعر وإعادة تحفيز نموه من جديد.
            ترطيب الشعر واستعادة حيويته: تساعد الكزبرة بشكل كبير على استعادة الحيوية المفقودة للشعر بسبب احتوائها على نسب عالية من مضادات الأكسدة والفيتامينات.
            تقوية جذور الشعر: تحتوي الكزبرة على مجموعة من الفيتامينات الهامة التي تساعد على تقوية جذور الشعر بشكل ملحوظ.
            مكافحة قشرة الشعر: للكزبرة خصائص مقاومة للالتهاب والفطريات وتساعد على تعقيم فروة الرأس لذا فهي وصفة مثالية لمكافحة قشرة الشعر.
            كيف تستخدم الكزبرة للشعر؟
            هناك عدة طرق مختلفة تستطيع من خلالها تحصيل فوائد الكزبرة المتنوعة للشعر، اختر منها ما يناسبك، ففوائد الكزبرة لا تقتصر على أوراقها الطازجة فحسب، بل تشمل المشتقات التالية لهذه النبتة الرائعة:'
            ,
            '            تعد السلطة من الأطباق الرئيسية التي لا يجب التخلي عنها في وجبة الغداء، حيث تمنح الجسم أهم العناصر الغذائية التي يحتاجها، كما أنها تساعد على الشعور بالشبع، وبالتالي تقليل الرغبة في تناول الأطعمة الأخرى، ولذلك ينصح بتناول طبق السلطة أولاً في وجبة الغداء.

            بالإضافة إلى السلطة الخضراء الشهيرة، نخبرك بأفضل أنواع السلطات التي تساعد على الشبع ولا تحتوي على كمية كبيرة من السعرات الحرارية.
            طريقة عمل سلطة دجاج سيزر
            تتسم هذه السلطة باحتوائها على أهم العناصر الغذائية وتساعد على الشعور بالشبع، فهي تحتوي على صدور الدجاج منزوعة الجلد، وتمد الجسم بنسبة كبيرة من البروتين المشبع
                       طريقة تحضير سلطة دجاج سيزر
            إليكِ طريقة تحضير سلطة دجاج سيزر.

            إمزجي الثوم وعصير الليمون والملح والفلفل في وعاء.
            في وعاء آخر، إمزجي الخس والدجاج والخبز المحمص.
            قومي بسكب مزيج الليمون والثوم على الدجاج والخس.
            قدمي السلطة في أطباق صغيرة بعدد أفراد الأسرة.
            طريقة عمل السلطة يونانية
            تحتوي السلطة اليونانية على دهون صحية مفيدة ومشبعة، بالإضافة إلى الألياف، وتتسم بأنها قليلة السعرات وتساعد على الشعور بالشبع. '
            ,
            'كشف باحثون في دراسة جديدة من جامعة أوكسفورد الأمريكية، أن قد يكون بمقدورهم تطوير الية تمكنهم من حماية الأطفال من الإصابة بالسكري من النوع الأول في مرحلة مبكرة من حياتهم.

            وأشار الباحثون القائمون على الدراسة أن الفكرة من ذلك تكمن في تدريب الجهاز المناعي الخاص بالأطفال من خلال إعطائهم أنسولين على شكل بودرة، الأمر الذي يوفر حماية طويلة المدى لهم.

             ويعتقد الباحثون أن إعطاء بودرة الأنسولين للأطفال منذ عمر الست أشهر وصولًا إلى الثلاث سنوات قد يساعدهم في الحماية من الإصابة بمرض السكري.

            وسيكون على المشتركين زيارة الباحثين بشكل متكرر للتأكد من سيرورة التجربة، علمًا أن نصف المشتركين سيقومون باستخدام بودرة الانسولين فقط.

            جدير بالذكر أن واحد من كل 100 طفل تقريبًا يملك جينات ترفع من خطر إصابته بمرض السكري من النوع الأول، ومن الممكن تتبعه من خلال فحص دم بسيط.

            ويأمل الباحثون أن بودرة الأنسولين ستساعد الجهاز المناعي في تحمل الانسولين الموجود في الجسم من أجل منع الإصابة بالمرض، وتجدر الإشارة أنه لا يوجد حتى الان أي طريقة تساعد في الوقاية من السكري.ويعتبر الأنسولين الهرمون المتحكم بمستوى السكر في الدم، ونقصانه يسبب الإصابة بمرض السكري.'
            ,
            'تشخيص مرض السرطان في مراحله المبكرة يوفّر أفضل الفرص للشفاء منه. إذا كان المريض يشعر بأعراض مثيرة للشكوك، فعليه التشاور مع طبيبه حول أي من الفحوصات والتفريسات هي الأنسب له للكشف المبكر عن السرطان.

                لقد أظهرت الأبحاث أن إجراء تفريسات للكشف المبكر عن السرطان قد ينقذ الحياة فعلا في بعض أنواع السرطان. أما بالنسبة لأنواع أخرى من السرطان، فلا يتم إجراء تفريسات الكشف المبكر عن السرطان إلا للأشخاص الأكثر عرضة للإصابة بمرض السرطان، فقط. ناقش مع طبيبك مدى وجود عوامل الخطر بالنسبة إليك.

                الجمعية الأمريكية لمكافحة السرطان توصي بإجراء تفريسات الكشف المبكر عن مرض السرطان للأشخاص ذوي عوامل خطر بدرجة متوسطة ​​للإصابة بأنواع السرطان التالية:

                سرطان الثدي: للنساء من سن 40 عاما وما فوق
                سرطان عنق الرحم: للنساء من سن 21 عاما وما فوق، أو بعد ثلاث سنوات من الجماع الأول
                سرطان القولون (الأمعاء الغليظة): للرجال والنساء من سن 50 عاما وما فوق
                سرطان غدة البروستاتا: للرجال ابتداءً من سن 50 وما فوق
                تفريسات الكشف المبكر عن السرطان وبعض الإجراءات الأخرى لها مجموعة من الفوائد والنواقص. ناقش فوائد ونواقص كل فحص مع طبيبك لتحديد الفحص الأنسب للكشف عن السرطان.'
            ,
                'كشفت نتائج دراسة جديدة نشرت في المجلة العلمية (Journal of Experimental Psychology: General) أنه بعد بلوغ الإنسان السبعين من عمره، يصبح أكثر سعادة مقارنة بالمراحل العمرية السابقة.

                حيث وجد الباحثون القائمون على الدراسة أنه مع تقدم الإنسان بالعمر، يتوقف عن ملاحظة غضب الأشخاص من حوله، تمامًا مثل الأطفال.

                 وأضاف الباحثون أن السعادة تزداد مع التقدم بالعمر، الأمر الذي يشجع الإنسان على الحياة بشكل أكبر. وأوضح الباحثون أن الإنسان بمنتصف العمر يكون أقل سعادة، كما تكون مستويات الغضب والخوف أكبر.

                من أجل التوصل إلى هذه النتائج استهدف الباحثون حوالي 10,000 مشتركًا بكافة المراحل العمرية، وخضعوا إلى سلسلة من الأبحاث والدراسات.

                وقالت البروفيسورة (Laura Germine): "إن إدراك الإنسان لمشاعر الغضب والحزن يصبح أقل مع التقدم بالعمر، في حين يزداد إدراكه للسعادة، أي يصبح الإنسان أكثر تفاؤلًا".

                هذا ويمر الإنسان خلال حياته بعدة مراحل، وهي على النحو التالي:

                الطفولة: يبدأ إدراك المشاعر بالارتفاع، وتصبح ردة الفعل تجاه الغضب أكبر خلال المراهقة، وتزداد الحساسية أيضًا.
                في الثلاثينات: نصبح إدراكا لجميع المشاعر السلبية والإيجابية معًا
                في السبعينات: تقل المشاعر السلبية مثل الغضب والخوف، وتزداد نسبة السعادة.'
            ,
            'نشرت الهيئة العامة للغذاء والدواء السعودية منشوراً على حسابها الرسمي على موقع التواصل الإجتماعي تويتر، تحذر من خلاله من استخدام الخلطات العشبية.

                وأوضحت الهيئة أنه يروج لهذه الأعشاب والخلطات بالعديد من الفوائد، مثل:

                الحرمل: قادر على علاج الوسواس القهري
                الداتورا: علاجاً للربو
                بذور الخروع: لمنع الحمل
                العشرق: تساعد في التنحيف
                جوزة الطيب: جزء من البهارات
                العشر: يعالج أمراض البرد
                عرق الذهب: يعمل كطارد للبلغم
                الحنظل: علاجاً لمرض السكري.'
            ,
                 'لقد قامت العديد من الدراسات العلمية بالعثور على علاقة ما بين دهون البطن والإصابة بالنوبة القلبية، إلا أن هذه الدراسة الجديدة وجدت أن دهون البطن قد تكون السبب وراء إصابتك بالنوبة القلبية أكثر من مرة واحدة.

            حيث أشار الباحث الرئيسي في الدراسة السويدية الجديدة الدكتور هنية محمدي أن دهون البطن ترفع من خطر الإصابة بالنوبة القلبية أكثر من مرة بسبب تسكر الأوعية الدموية والجلطات الدموية المتكررة بسبب الدهون.

            كما أوضحت الدراسة أن العلاقة ما بين دهون البطن والإصابة بالنوبة القلبية قد تكون ناتجة عن زيادة ضغط الدم والسكر ومقاومة الانسولين، وجميعها عوامل خطر ترفع من الإصابة بالنوبة القلبية بشكل ملحوظ.'
            ,
            'عندما لا تنجح معك الوسائل الطبيعية في الإنجاب، قد تشعر بالخوف والقلق من الحصول على طفل أنابيب، إليك ما يجب عليك معرفته عن التلقيح الصناعي حتى قبل زيارة الطبيب.

            فيما يلي أهم الحقائق حول التلقيح الصناعي:

            1. يعد وسيلة فعالة للغاية لكنها ليست مضمونة دائمًا
            تم تطوير التلقيح الصناعي لأول مرة في السبعينيات، ولا يزال أحد أكثر الخيارات تقدمًا وفعالية في علاج مشاكل الخصوبة، لكنه لا يضمن لك نجاح فرصة الإنجاب بنسبة 100%. يمكن أن تؤثر العديد من العوامل على فرصة نجاح عملية التلقيح الصناعي عند الزوجين،  بما في ذلك عمر المرأة التي يتم استخدام بيضها للعلاج، وسبب علاج الخصوبة.

            2. قد يكون خيارًا ناجحًا للحالات المعقدة
            يرتبط العقم بالتساوي مع أسباب الذكور والإناث، وقد يكون التلقيح الصناعي خيارًا ممكنًا لمن يعانون من حالة طبية معقدة. تشمل بعض الأسباب الشائعة للعقم ما يلي:

            انسداد قناة فالوب، الذي  يمنع وصول الحيوانات المنوية إلى البويضة بشكل صحيح.
            اضطرابات التبويض، مثل متلازمة المبيض المتعدد الكيسات (PCOS)، التي تسبب اختلال التوازن الهرموني.
            قصور المبيض الأولي الناجم عن توقف المبايض عن أداء وظيفتها الطبيعية قبل سن 40 عام.
            الانتباذ البطاني الرحمي، الذي يحدث عندما ينمو النسيج الذي يبطن الرحم في مكان اخر، مثل المبيضين وقناة فالوب ومساحات الحوض الأخرى.
            الأورام الليفية الرحمية، وهي أورام حميدة تنمو في عضلة الرحم.
            العقم عند الذكور. '
            ,
            'يحتاج الجسم إلى مختلف العناصر الغذائية التي تساعد في الحفاظ على الصحة، وهناك مجموعة من الفيتامينات والمعادن اللازمة لتعزيز الصحة الجنسية، والتي يمكن الحصول عليها من خلال الأطعمة المختلفة.

            تعرف على أهم الفيتامينات والمعادن اللازمة لتحسين الصحة الجنسية.

            1- فيتامين ب
            يمكن أن يرتبط فقدان الرغبة الجنسية بنقص فيتامين ب في الجسم، حيث أن فيتامين ب يؤثر على الطاقة بشكل عام، وبالتالي يصعب ممارسة العلاقة الحميمة بصورة طبيعية نتيجة الشعور بالتعب والإرهاق المستمر ولذلك يجب الاهتمام بتناول الأطعمة الغنية بفيتامين ب مثل اللحوم والدواجن والبيض والخضروات الورقية، وإدراجها ضمن النظام الغذائي اليومي.

            2- مضادات الأكسدة
            تعد مضادات الأكسدة من أهم العناصر الغذائية الهامة لتعزيز الصحة الجنسية، حيث أنها تساعد على تحفيز إنتاج الهرمونات وزيادة الطاقة في الجسم وتنشيط الدورة الدموية.

            تتوفر مضادات الأكسدة في العديد من الأطعمة، وفي مقدمتها الفواكه والخضروات والحبوب الكاملة والمكسرات، كما يمكن الحصول على مستويات مرتفعة من مذادات الأكسدة عن طريق تناول الشاي الأخضر.'
            ,
            'يعد إرسال الطفل إلى الحضانة من الأمور التي تشغل بال أغلب الأمهات، حيث أن الطفل سوف ينفصل للمرأة الأولى عن والدته، ويبدأ في التعامل مع الاخرين ومواجهة المواقف المختلفة دون مساعدة الأم.

            وهذا أمر صحي للطفل، ولكن قبل اتخاذ القرار، يجب معرفة الموعد المناسب لذهاب الطفل إلى الحضانة.

            متى يجب أن يذهب طفلي إلى الحضانة؟
            يصعب تحديد موعد مناسب لذهاب الطفل إلى الحضانة، وذلك لوجود مجموعة من العوامل التي تتحكم في الأمر، مثل موعد عودة الأم للعمل ومدى توفر خيارات رعاية أخرى، بالإضافة إلى المسؤوليات المالية . وبغض النظر عن العوامل السابقة، لا يمكن تحدد موعد مناسب لذهاب الطفل إلى الحضانة وتطبيقه على كافة الأطفال، وذلك لوجود إختلاف بينهم في الشخصية والقدرات العقلية وغيرها.

            فعلى سبيل المثال، يمكن أن تجد الأم طفلها مستعداً للذهاب إلى الحضانة في عمر عامين، فيما تشعر أخرى بأن إبنها لازال صغيراً ويحتاج إلى مزيد من الرعاية في المنزل، حيث تأخر في الكلام ولن يتمكن من التعبير عن مشاعره، وحينها تقرر تأجيل الحضانة إلى عمر 3 أعوام، وهكذا تختلف المراحل المناسبة من طفل لاخر.

            ويمكن للأم أن تستعين ببعض العلامات التي تؤشر باستعداد الطفل للذهاب إلى الحضانة'





        ];
        $images = ['images/articles/1.jpg', 'images/articles/2.jpg', 'images/articles/3.jpg', 'images/articles/4.jpg', 'images/articles/5.jpg', 'images/articles/6.jpg', 'images/articles/7.jpg', 'images/articles/8.jpg','images/articles/9.jpg','images/articles/10.jpg'];

        for($i = 0; $i < count($category); $i++)
        {
            Article::create([
                'category_id' => $category[$i],
                'title' => $title[$i],
                'description' => $decription[$i],
                'image' => $images[$i],
                'view_count' => 0
            ]);
        }
    }
}
